# Проект по SQL

Цель работы проанализировать базу данных о книгах, издательствах, авторах, а также пользовательские обзорах на книги и подготовить общую информацию по сфере для заказчика

<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Загрузка-данных" data-toc-modified-id="Загрузка-данных-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Загрузка данных</a></span></li><li><span><a href="#Задание-1" data-toc-modified-id="Задание-1-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Задание 1</a></span></li><li><span><a href="#Задание-2" data-toc-modified-id="Задание-2-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Задание 2</a></span></li><li><span><a href="#Задание-3" data-toc-modified-id="Задание-3-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Задание 3</a></span></li><li><span><a href="#Задание-4" data-toc-modified-id="Задание-4-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Задание 4</a></span></li><li><span><a href="#Задание-5" data-toc-modified-id="Задание-5-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Задание 5</a></span></li><li><span><a href="#Результаты-работы" data-toc-modified-id="Результаты-работы-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Результаты работы</a></span></li></ul></div>

## Загрузка данных

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
 db_config['pwd'],
 db_config['host'],
 db_config['port'],
 db_config['db'])
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

In [2]:
query_books = '''SELECT * FROM books'''
books=pd.io.sql.read_sql(query_books, con = engine)
books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [3]:
query_authors = '''SELECT * FROM authors'''
authors=pd.io.sql.read_sql(query_authors, con = engine)
authors.head()

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

In [4]:
query_ratings = '''SELECT * FROM ratings'''
ratings=pd.io.sql.read_sql(query_ratings, con = engine)
ratings.head()

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [5]:
query_reviews = '''SELECT * FROM reviews'''
reviews=pd.io.sql.read_sql(query_reviews, con = engine)
reviews.head()

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

In [6]:
query_publishers = '''SELECT * FROM publishers'''
publishers=pd.io.sql.read_sql(query_publishers, con = engine)
publishers.head()

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

## Задание 1

In [7]:
task1='''SELECT count(book_id) 
        From books
        WHERE publication_date>'2000-01-01'
        '''
data= pd.io.sql.read_sql(task1, con=engine)
data

   count
0    819

Всего после 1 января 2000 года вышло 819 книг

## Задание 2

In [8]:
task2_1='''SELECT count(review_id) 
        From reviews
        '''
data= pd.io.sql.read_sql(task2_1, con=engine)
data

   count
0   2793

In [9]:
task2='''with css as (Select book_id, count(review_id) rev 
                from reviews group by book_id),

cssd as (Select book_id, avg(rating) rate from ratings group by book_id)

        Select boo.book_id, boo.title, rev,rate
        From books as boo
        left join css on boo.book_id=css.book_id
        Left join cssd on boo.book_id=cssd.book_id
          Group by boo.book_id, boo.title,rev,rate
        '''

data= pd.io.sql.read_sql(task2, con=engine)
data

     book_id                                              title  rev      rate
0        673                             The Catcher in the Rye  6.0  3.825581
1        415                     Magic Bites (Kate Daniels  #1)  4.0  4.500000
2          7               2nd Chance (Women's Murder Club  #2)  3.0  3.000000
3        854                                           The Road  6.0  3.772727
4        270  Fullmetal Alchemist  Vol. 1 (Fullmetal Alchemi...  2.0  4.250000
..       ...                                                ...  ...       ...
995      277  Getting Things Done: The Art of Stress-Free Pr...  3.0  3.750000
996      783                             The Looking Glass Wars  2.0  4.000000
997      520                                         Possession  3.0  4.000000
998      426                                Memoirs of a Geisha  5.0  4.195652
999      375                                          King Lear  3.0  4.333333

[1000 rows x 4 columns]

In [10]:
data['rev'].sum()#проверка

2793.0

Количество обзоров и средняя оценка для каждой книги посчитаны.

##  Задание 3

In [11]:
task3='''SELECT boo.publisher_id, pub.publisher, count(boo.book_id)
        From books as boo
        INNER JOIN publishers as pub on boo.publisher_id=pub.publisher_id
        Where boo.num_pages>50
        GROUP BY boo.publisher_id, pub.publisher
        ORDER BY count desc
        Limit 1
        '''
data= pd.io.sql.read_sql(task3, con=engine)
data

   publisher_id      publisher  count
0           212  Penguin Books     42

Наибольшее число книг(50 страниц и более) выпустило издательство Penguin Books

## Задание 4

In [12]:
task4='''SELECT first.author, avg(da) as avg
FROM 
(SELECT aut.author, avg(rat.rating) as da, count(rat.rating)
FROM authors as aut
Inner join books as boo on aut.author_id=boo.author_id
Inner join ratings as rat on boo.book_id=rat.book_id
Group by boo.book_id,aut.author
HAVING count(rat.rating)>=50) as first
Group by first.author
order by avg desc
limit 5'''
data= pd.io.sql.read_sql(task4, con=engine)
data

                              author       avg
0         J.K. Rowling/Mary GrandPré  4.283844
1  Markus Zusak/Cao Xuân Việt Khương  4.264151
2                     J.R.R. Tolkien  4.258446
3                  Louisa May Alcott  4.192308
4                       Rick Riordan  4.080645

Самая высокая средняя оценка книг у Джоан Роулинг

## Задание 5

In [13]:
task5='''SELECT  round(avg(da.rev1))
From (Select username, count(review_id) as rev1
from reviews as rev
where username in (Select username
from ratings 
Group by username
Having count(rating_id)>=51)
Group by username) as da'''

data= pd.io.sql.read_sql(task5, con=engine)
data
#Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

   round
0   24.0

Среднее количество обзоров от пользователей, которые поставили больше 50 оценок - 24 ед.

## Результаты работы

1) Всего после 1 января 2000 года вышло 819 книг
2) Количество обзоров и средняя оценка для каждой книги посчитаны.
3) Наибольшее число книг(50 страниц и более) выпустило издательство Penguin Books
4) Самая высокая средняя оценка книг у Джоан Роулинг
5) Среднее количество обзоров от пользователей, которые поставили больше 50 оценок - 24 ед.